# ExportPatternInfo Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportPatternInfo Members
ExportPatternInfo Class Constructors Methods Properties See Also
---
The ExportPatternInfo type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExportPatternInfo()()()() | Constructs a new default ExportPatternInfo. |
| ExportPatternInfo(String) | Constructs a new ExportPatternInfo using the destination pattern name as input. |
| ExportPatternInfo(ExportPatternInfo) | Constructs a new copy of the input ExportPatternInfo object. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ExportPatternInfo |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DestinationPatternName | The destination pattern name (the name of the pattern in the exported format). |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ExportPatternInfo Class
Autodesk.Revit.DB Namespace